# ForgeSchemaService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..ForgeSchemaService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
Autodesk Internal: The service for interacting with the Forge Schema Service.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId ForgeSchemaService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ForgeSchemaService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ ForgeSchemaService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace